In [1]:
import pandas as pd

### eval 함수 장점

대규모 복잡한 데이터프레임워크 간의 연산에서 좋은 성능을 낼 수 있다.  
연산시 변수처리를 할 수 있어 대화형(interactive) 검색을 할 수 있다.

### eval 함수 단점

간단한 연산 수행시 성능상의 차이가 없다. 또는 나쁠 수 있다.  
특정 연산에 제약이 있을 수 있다.

In [2]:
import numpy as np

In [5]:
rng = np.random.RandomState(42)

In [6]:
nrows, ncols = 100000, 10

In [7]:
print(type(pd.DataFrame(rng.rand(nrows,ncols)) for i in range(2)))

<class 'generator'>

0,1 두번 for문의 루프가 반복되면서 nrows,ncolse 크기의 데이터프레임을 각각 생성한다.

In [8]:
df1,df2 = (pd.DataFrame(rng.rand(nrows, ncols))for i in range(2))

In [9]:
df1.head()

,0,1,2,3,4,5,6,7,8,9
0,0.374540,0.950714,0.731994,0.598658,0.156019,0.155995,0.058084,0.866176,0.601115,0.708073
1,0.020584,0.969910,0.832443,0.212339,0.181825,0.183405,0.304242,0.524756,0.431945,0.291229
2,0.611853,0.139494,0.292145,0.366362,0.456070,0.785176,0.199674,0.514234,0.592415,0.046450
3,0.607545,0.170524,0.065052,0.948886,0.965632,0.808397,0.304614,0.097672,0.684233,0.440152
4,0.122038,0.495177,0.034389,0.909320,0.258780,0.662522,0.311711,0.520068,0.546710,0.184854

In [10]:
df2.head()

,0,1,2,3,4,5,6,7,8,9
0,0.595156,0.364717,0.005376,0.561088,0.896570,0.531717,0.780488,0.161954,0.137298,0.893944
1,0.782998,0.347410,0.800172,0.075326,0.517900,0.881456,0.843601,0.371253,0.228849,0.867865
2,0.266901,0.822025,0.266517,0.984533,0.360120,0.255362,0.599228,0.359710,0.810427,0.732750
3,0.632495,0.422013,0.834611,0.306137,0.295722,0.091476,0.563500,0.696945,0.712998,0.861404
4,0.567160,0.025521,0.175390,0.561330,0.317477,0.864216,0.228547,0.255269,0.842986,0.581316

In [11]:
(df1+df2).head(5)

,0,1,2,3,4,5,6,7,8,9
0,0.969696,1.315431,0.737370,1.159746,1.052589,0.687711,0.838571,1.028130,0.738413,1.602016
1,0.803583,1.317320,1.632615,0.287665,0.699725,1.064861,1.147843,0.896010,0.660794,1.159094
2,0.878754,0.961518,0.558662,1.350895,0.816190,1.040538,0.798902,0.873944,1.402842,0.779200
3,1.240040,0.592538,0.899663,1.255023,1.261354,0.899873,0.868114,0.794617,1.397231,1.301557
4,0.689199,0.520698,0.209779,1.470651,0.576257,1.526738,0.540258,0.775337,1.389696,0.766170

In [12]:
 pd.eval('df1 + df2').head(5)

,0,1,2,3,4,5,6,7,8,9
0,0.969696,1.315431,0.737370,1.159746,1.052589,0.687711,0.838571,1.028130,0.738413,1.602016
1,0.803583,1.317320,1.632615,0.287665,0.699725,1.064861,1.147843,0.896010,0.660794,1.159094
2,0.878754,0.961518,0.558662,1.350895,0.816190,1.040538,0.798902,0.873944,1.402842,0.779200
3,1.240040,0.592538,0.899663,1.255023,1.261354,0.899873,0.868114,0.794617,1.397231,1.301557
4,0.689199,0.520698,0.209779,1.470651,0.576257,1.526738,0.540258,0.775337,1.389696,0.766170

In [13]:
%timeit df1 + df2

3.47 ms ± 188 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [14]:
%timeit pd.eval('df1 + df2')

4.12 ms ± 96 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

allclose => 두 연산의 결과가 같은지 판단하여 true/false 를 반환

In [15]:
np.allclose(df1+df2, pd.eval('df1+df2'))

True

In [16]:
nrows1, ncols1 = 100000, 100

In [17]:
df11,df12,df13,df14 = (pd.DataFrame(rng.rand(nrows1, ncols1))for i in range(4))

In [18]:
%timeit df11 + df12 + df13 + df14

87.6 ms ± 3.92 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

보다 많은 데이터를 생성하고 데이터프레임도 확대대는 경우 좋은 성능을 낼 수 있다.

In [19]:
%timeit pd.eval('df11 + df12 + df13 + df14')

40.2 ms ± 1.55 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [20]:
dfa1 = pd. DataFrame(np.random.randn(10, 2), columns=['평균','분산'])
dfa1

         평균        분산
0 -1.595176  0.991119
1 -0.250873 -0.856129
2  1.983995  0.651479
3 -1.291590 -1.522356
4  1.649737 -0.668447
5 -0.394527  0.141497
6  1.021316  0.199125
7 -1.229653 -0.077137
8 -2.821669  1.236230
9 -1.373782 -1.431676

In [21]:
dfa1.eval( '평균 + 분산 ')

0   -0.604057
1   -1.107002
2    2.635474
3   -2.813945
4    0.981291
5   -0.253030
6    1.220440
7   -1.306790
8   -1.585439
9   -2.805457
dtype: float64

In [22]:
dfa1.eval( '편차  = 평균 - 분산 ')

         평균        분산        편차
0 -1.595176  0.991119 -2.586295
1 -0.250873 -0.856129  0.605257
2  1.983995  0.651479  1.332515
3 -1.291590 -1.522356  0.230766
4  1.649737 -0.668447  2.318184
5 -0.394527  0.141497 -0.536024
6  1.021316  0.199125  0.822191
7 -1.229653 -0.077137 -1.152517
8 -2.821669  1.236230 -4.057899
9 -1.373782 -1.431676  0.057894

원본은 그대로

In [23]:
dfa1

         평균        분산
0 -1.595176  0.991119
1 -0.250873 -0.856129
2  1.983995  0.651479
3 -1.291590 -1.522356
4  1.649737 -0.668447
5 -0.394527  0.141497
6  1.021316  0.199125
7 -1.229653 -0.077137
8 -2.821669  1.236230
9 -1.373782 -1.431676

수정한 값 원본에 저장

In [24]:
dfa1.eval( '편차 = 평균 - 분산 ', inplace=True)
dfa1

         평균        분산        편차
0 -1.595176  0.991119 -2.586295
1 -0.250873 -0.856129  0.605257
2  1.983995  0.651479  1.332515
3 -1.291590 -1.522356  0.230766
4  1.649737 -0.668447  2.318184
5 -0.394527  0.141497 -0.536024
6  1.021316  0.199125  0.822191
7 -1.229653 -0.077137 -1.152517
8 -2.821669  1.236230 -4.057899
9 -1.373782 -1.431676  0.057894

In [25]:
dfa2 = pd. DataFrame(np.random.randn(10, 2), columns=range(0,2))
dfa2

          0         1
0 -1.034243  0.281773
1  0.225927  0.367802
2  0.231941  0.391112
3 -0.062383 -0.216530
4  0.735096 -0.460369
5  1.769831 -0.947468
6 -1.107906  0.742290
7  0.110620  1.701852
8 -0.136002 -0.630108
9 -1.904393  0.859944

열이름을 사용하여 연산을 할 수 있을까?

In [26]:
dfa2.eval( '0 +1 ')

1

.을 통해 열 접근은?

In [27]:
try:
    pd.eval('dfa2.0 + dfa2.1')
except Exception as e:
    print("exception ", e)

exception  invalid syntax (<unknown>, line 1)

올바른 사용 예

In [28]:
try :
    df_add = pd.eval('dfa2[0] + dfa2[1]')
except Exception as e  :
    print("exception ", e)

In [29]:
df_add

0   -0.752470
1    0.593729
2    0.623053
3   -0.278913
4    0.274726
5    0.822363
6   -0.365616
7    1.812473
8   -0.766111
9   -1.044450
dtype: float64

In [30]:
df1, df2, df3, df4, df5 = (pd.DataFrame(rng.randint(0, 1000, (100, 3)))
                           for i in range(5))

In [37]:
result1 = -df1 * df2 / (df3 + df4) - df5
result1

              0            1            2
0   -572.348754  -974.080479  -488.160055
1   -880.555699 -1505.816327  -874.009346
2   -795.468354  -568.731673 -1239.764706
3   -911.075275  -721.391773  -771.392575
4   -657.334501  -886.487668  -703.666667
..          ...          ...          ...
95 -1001.337143  -404.619681 -3129.936937
96 -2644.270386  -845.731986  -648.072041
97  -701.121081  -373.861163  -173.316456
98  -970.757522  -918.941292  -379.006993
99  -877.746411  -417.555814  -757.590361

[100 rows x 3 columns]

In [38]:
result2 = pd.eval('-df1 * df2 / (df3 + df4) - df5')
result2

              0            1            2
0   -572.348754  -974.080479  -488.160055
1   -880.555699 -1505.816327  -874.009346
2   -795.468354  -568.731673 -1239.764706
3   -911.075275  -721.391773  -771.392575
4   -657.334501  -886.487668  -703.666667
..          ...          ...          ...
95 -1001.337143  -404.619681 -3129.936937
96 -2644.270386  -845.731986  -648.072041
97  -701.121081  -373.861163  -173.316456
98  -970.757522  -918.941292  -379.006993
99  -877.746411  -417.555814  -757.590361

[100 rows x 3 columns]

In [33]:
np.allclose(result1, result2)

True

브로드캐스팅을 통한 비교연산

In [39]:
result1 = (df1 < 0.5) & (df2 < 0.5) | (df3 < df4)
result1

        0      1      2
0   False  False  False
1   False   True  False
2    True   True  False
3    True   True  False
4   False  False   True
..    ...    ...    ...
95   True  False   True
96   True  False  False
97  False  False  False
98  False  False   True
99   True  False  False

[100 rows x 3 columns]

In [40]:
result2 = pd.eval('(df1 < 0.5) & (df2 < 0.5) | (df3 < df4)')
result2

        0      1      2
0   False  False  False
1   False   True  False
2    True   True  False
3    True   True  False
4   False  False   True
..    ...    ...    ...
95   True  False   True
96   True  False  False
97  False  False  False
98  False  False   True
99   True  False  False

[100 rows x 3 columns]

In [36]:
np.allclose(result1, result2)

True

In [41]:
result3 = pd.eval('(df1 < 0.5) and (df2 < 0.5) or (df3 < df4)')
result3

        0      1      2
0   False  False  False
1   False   True  False
2    True   True  False
3    True   True  False
4   False  False   True
..    ...    ...    ...
95   True  False   True
96   True  False  False
97  False  False  False
98  False  False   True
99   True  False  False

[100 rows x 3 columns]

In [42]:
np.allclose(result1, result3)

True

In [43]:
df = pd. DataFrame(np.random.randn(10, 2), columns=list('AB'))
df

          A         B
0 -1.121827 -0.542750
1  1.311574  1.417933
2 -0.140663 -0.426193
3  1.019200 -0.080342
4 -1.582840 -0.364597
5  0.625446 -2.063651
6  0.507872 -0.177140
7 -2.212896 -0.015931
8  1.060322  1.224984
9  2.879722 -0.368686

In [44]:
column_mean = df.mean(axis=1)
column_mean.head()

0   -0.832288
1    1.364753
2   -0.283428
3    0.469429
4   -0.973719
dtype: float64

In [45]:
result1 = df['A'] + column_mean
result1

0   -1.954115
1    2.676328
2   -0.424091
3    1.488628
4   -2.556559
5   -0.093656
6    0.673239
7   -3.327310
8    2.202975
9    4.135240
dtype: float64

In [46]:
result2 = df.eval('A + @column_mean')
result2

0   -1.954115
1    2.676328
2   -0.424091
3    1.488628
4   -2.556559
5   -0.093656
6    0.673239
7   -3.327310
8    2.202975
9    4.135240
dtype: float64

In [47]:
np.allclose(result1, result2)

True